Revit 2024 API
NumericRevisionSettings Constructor
 Constructs a NumericRevisionSettings with a simple, default numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public NumericRevisionSettings()
Visual Basic
Public Sub New
Visual C++
public:
NumericRevisionSettings()
Remarks
 Initializes startNumber to 1. The prefix and suffix strings are set to empty.
See Also
NumericRevisionSettings Class
NumericRevisionSettings Overload
Autodesk.Revit.DB Namespace